p2000t/M2000/src/Allegro/Main.c
/******************************************************************************/
/*                             M2000 - the Philips                            */
/*                ||||||||||||||||||||||||||||||||||||||||||||                */
/*                ████████|████████|████████|████████|████████                */
/*                ███||███|███||███|███||███|███||███|███||███                */
/*                ███||███||||||███|███||███|███||███|███||███                */
/*                ████████|||||███||███||███|███||███|███||███                */
/*                ███|||||||||███|||███||███|███||███|███||███                */
/*                ███|||||||███|||||███||███|███||███|███||███                */
/*                ███||||||████████|████████|████████|████████                */
/*                ||||||||||||||||||||||||||||||||||||||||||||                */
/*                                  emulator                                  */
/*                                                                            */
/*   Copyright (C) 2013-2023 by the M2000 team.                               */
/*                                                                            */
/*   See the file "LICENSE" for information on usage and redistribution of    */
/*   this file, and for a DISCLAIMER OF ALL WARRANTIES.                       */
/******************************************************************************/

#define CHAR_PIXEL_WIDTH 2 //must be even
#define CHAR_PIXEL_HEIGHT 2
#define CHAR_TILE_WIDTH (6*CHAR_PIXEL_WIDTH)
#define CHAR_TILE_SPACE 3
#define CHAR_TILE_HEIGHT (10*CHAR_PIXEL_HEIGHT)
#define FONT_BITMAP_WIDTH (96+64+64)*(CHAR_TILE_WIDTH + CHAR_TILE_SPACE)

#ifdef __APPLE__
#define ALLEGRO_UNSTABLE // needed for al_clear_keyboard_state();
#endif

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <allegro5/allegro.h>
#include <allegro5/allegro_image.h>
#include <allegro5/allegro_primitives.h>
#include <allegro5/allegro_audio.h>
#include <allegro5/allegro_native_dialog.h> 
#include "../P2000.h"
#include "../M2000.h"
#include "../Common.h"
#include "Main.h"
#include "Keyboard.h"
#include "Menu.h"
#include "State.h"
#include "Config.h"

/****************************************************************************/
/*** Deallocate resources taken by InitMachine()                          ***/
/****************************************************************************/
void TrashMachine(void)
{
  if (Verbose) printf("\n\nShutting down...\n");
  if (soundbuf) free (soundbuf);
  if (OldCharacter) free (OldCharacter);
}

int ReturnErrorMessage(const char *format, ...)
{
  char string[1024];
  va_list args;
  va_start(args, format);
  vsprintf(string, format, args);
  va_end(args);
  al_show_native_message_box(NULL, Title, "", string, "", ALLEGRO_MESSAGEBOX_ERROR);
  return EXIT_FAILURE; //always returns error code
}

void ClearScreen() 
{
  al_set_target_bitmap(al_get_backbuffer(display));
  al_clear_to_color(al_map_rgb(0, 0, 0));
  memset(OldCharacter, -1, 80 * 24 * sizeof(int)); //clear old screen characters
}

void ResetAudioStream() 
{
    if (Verbose) printf("  Creating the audio stream: ");
    for (buf_size = 4096; buf_size >= 128; buf_size /= 2) if (buf_size * IFreq <= 44100) break;
    sample_rate = buf_size * IFreq;
    if (Verbose) printf("%d Hz, buffer size %d...", sample_rate, buf_size);
    if (soundbuf) free(soundbuf);
    soundbuf = malloc(buf_size);
    if (stream) {
      al_detach_audio_stream(stream);
      al_destroy_audio_stream(stream);
    }
    stream = al_create_audio_stream(4, buf_size, sample_rate, ALLEGRO_AUDIO_DEPTH_UINT8, ALLEGRO_CHANNEL_CONF_1);
    if (!stream || !soundbuf) {
      if (Verbose) puts("FAILED");
      soundDetected = 0;
    }
    else if (Verbose) puts("OK");

    if (Verbose) printf("  Connecting to the default mixer...");
    if (!mixer) mixer = al_get_default_mixer();
    if (!al_attach_audio_stream_to_mixer(stream, mixer))
    {
      if (Verbose) puts("FAILED");
      soundDetected = 0;
    }
    else if (Verbose) puts("OK");
}

void UpdateWindowTitle() 
{
  static char windowTitle[ALLEGRO_NEW_WINDOW_TITLE_MAX_SIZE];
  sprintf(windowTitle, "%s [%s]", Title, currentTapePath ? al_get_path_filename(currentTapePath) : "empty");
  al_set_window_title(display, windowTitle);
}

void ToggleFullscreen() 
{
#ifdef __linux__
  return;
#endif
  ClearScreen();
  if (al_get_display_flags(display) & ALLEGRO_FULLSCREEN_WINDOW) {
    //back to window mode
    DisplayWidth = _DisplayWidth;
    DisplayHeight = _DisplayHeight;
    DisplayTileWidth = _DisplayTileWidth;
    DisplayTileHeight = _DisplayTileHeight;
    DisplayHBorder = _DisplayHBorder;
    DisplayVBorder = _DisplayVBorder;
    if (Verbose) printf("Back to window %ix%i\n", DisplayWidth + 2*DisplayHBorder, DisplayHeight + 2*DisplayVBorder);
#ifdef __APPLE__
    al_set_display_flag(display , ALLEGRO_FULLSCREEN_WINDOW , 0);
    al_resize_display(display, DisplayWidth + 2*DisplayHBorder, DisplayHeight + 2*DisplayVBorder);
#else
    al_resize_display(display, DisplayWidth + 2*DisplayHBorder, DisplayHeight + 2*DisplayVBorder);
    al_set_display_flag(display , ALLEGRO_FULLSCREEN_WINDOW , 0);
#endif
    al_show_mouse_cursor(display);
    al_set_display_menu(display,  menu);
  } else {
    //go fullscreen and hide menu and mouse
    al_remove_display_menu(display);
    al_hide_mouse_cursor(display);
    _DisplayWidth = DisplayWidth;
    _DisplayHeight = DisplayHeight;
    _DisplayTileWidth = DisplayTileWidth;
    _DisplayTileHeight = DisplayTileHeight;
    _DisplayHBorder = DisplayHBorder;
    _DisplayVBorder = DisplayVBorder;

    DisplayHeight = ((monitorInfo.y2 - monitorInfo.y1) / 240) * 240;
    DisplayWidth = DisplayHeight * 4 / 3;
    DisplayVBorder = (monitorInfo.y2 - monitorInfo.y1 - DisplayHeight) / 2;
    DisplayHBorder = (monitorInfo.x2 - monitorInfo.x1 - DisplayWidth) / 2;
    DisplayTileWidth = DisplayWidth / 40;
    DisplayTileHeight = DisplayHeight / 24;
    if (Verbose) printf("Fullscreen resizing to %ix%i\n",DisplayWidth + 2*DisplayHBorder, DisplayHeight + 2*DisplayVBorder);
    al_resize_display(display, DisplayWidth + 2*DisplayHBorder, DisplayHeight + 2*DisplayVBorder);
    al_set_display_flag(display , ALLEGRO_FULLSCREEN_WINDOW , 1);
  }
}

