p2000t/M2000/src/Allegro/Main.c
int CopyFile(ALLEGRO_PATH *sourceFolder, const char * filename, ALLEGRO_PATH *destinationFolder) 
{
  if (!al_make_directory(al_path_cstr(destinationFolder, PATH_SEPARATOR))) return 1;

  al_set_path_filename(sourceFolder, filename);
  al_set_path_filename(destinationFolder, filename);
  const char * sourceFile = al_path_cstr(sourceFolder, PATH_SEPARATOR);
  const char * destFile = al_path_cstr(destinationFolder, PATH_SEPARATOR);
  al_set_path_filename(sourceFolder, NULL);
  al_set_path_filename(destinationFolder, NULL);
  if (!al_filename_exists(sourceFile)) {
    if (Verbose) printf("[CopyFile] SourceFile %s does not exist\n", sourceFile);
    return 1;
  }
  if (al_filename_exists(destFile)) {
    if (Verbose) printf("[CopyFile] DestFile %s already exists\n", destFile);
    return 0;
  }

  if (Verbose) printf("[CopyFile] Copying %s to %s ...", sourceFile, destFile);
  FILE *f_s;
  FILE *f_d;
  char buf[1024];
  size_t size;
  int ret = 1;
  if ((f_s = fopen(sourceFile, "rb"))) {
    if ((f_d = fopen(destFile, "wb"))) {
      while ((size = fread(buf, 1, 1024, f_s)))
        fwrite(buf, 1, size, f_d);
      fclose(f_d);
      ret = 0;
    }
    fclose(f_s);
  }
  if (Verbose) puts(ret ? "FAILED" : "OK");
  return ret;
}

void InitDocumentFolders() 
{
  int i;
  ALLEGRO_PATH *resourcePath = al_get_standard_path(ALLEGRO_RESOURCES_PATH);
  // debian install check
  if (!strcmp(al_path_cstr(resourcePath, PATH_SEPARATOR), "/usr/bin/"))
    resourcePath = al_create_path_for_directory("/usr/share/M2000/");

  CopyFile(resourcePath, "README.md", docPath);
  al_set_path_filename(docPath, NULL);

  if (!al_filename_exists(al_path_cstr(userCassettesPath, PATH_SEPARATOR)))
    for (i=0; installCassettes[i]; i++)
      CopyFile(resourcePath, installCassettes[i], userCassettesPath);

  if (!al_filename_exists(al_path_cstr(userCartridgesPath, PATH_SEPARATOR)))
    for (i=0; installCartridges[i]; i++)
      CopyFile(resourcePath, installCartridges[i], userCartridgesPath);

  al_make_directory(al_path_cstr(userScreenshotsPath, PATH_SEPARATOR));

  al_make_directory(al_path_cstr(userVideoRamDumpsPath, PATH_SEPARATOR));

  al_make_directory(al_path_cstr(userSavestatesPath, PATH_SEPARATOR));

  al_destroy_path(resourcePath);
}

/****************************************************************************/
/*** Initialise all resources needed by the Linux/SVGALib implementation  ***/
/****************************************************************************/
int InitMachine(void)
{
  int startFullScreen = (videomode == FULLSCREEN_VIDEO_MODE);

  if (TapeName) 
    currentTapePath = al_create_path(TapeName);

  /* get primary display monitor info */
  for (int i=0; i<al_get_num_video_adapters(); i++) {
    if (al_get_monitor_info(i, &monitorInfo) && monitorInfo.x1 == 0 && monitorInfo.y1 == 0) {
      if (Verbose) printf("Primary fullscreen display: %i x %i\n", monitorInfo.x2 - monitorInfo.x1, monitorInfo.y2 - monitorInfo.y1);
      break; //primary display found
    }
  }

  InitDocumentFolders();

  if (Verbose) printf("Initialising and detecting joystick... ");
  joyDetected=0; //assume not found
  if (al_install_joystick()) {
    if ((joystick = al_get_joystick(0)) != NULL) {
      joyDetected = 1;
      if (Verbose) puts("OK");
    }
  }
  if (!joyDetected && Verbose) puts("FAILED");

  if (Verbose) printf("Creating the display window... ");
  InitVideoMode();
  UpdateDisplaySettings();
#ifdef __linux__
  al_set_new_display_flags (ALLEGRO_WINDOWED | ALLEGRO_GTK_TOPLEVEL); // ALLEGRO_GTK_TOPLEVEL required for menu in Linux
#else
  al_set_new_display_flags (ALLEGRO_WINDOWED);
#endif
  al_set_new_display_option(ALLEGRO_SINGLE_BUFFER, 1, ALLEGRO_REQUIRE); //require single buffer
#ifdef __linux__
  // for Linux create smallest display, as it does not correctly scale back
  if ((display = al_create_display(Displays[1][0], Displays[1][1])) == NULL)
#else
  if ((display = al_create_display(DisplayWidth + 2*DisplayHBorder, DisplayHeight + 2*DisplayVBorder)) == NULL)
#endif
    return ReturnErrorMessage("Could not initialize display.");

  if (Verbose) puts("OK");

  if (Verbose) printf("Creating timer and queues... ");
  eventQueue = al_create_event_queue();
  timerQueue =  al_create_event_queue();
  timer = al_create_timer(1.0 / IFreq);
  if (!eventQueue || !timerQueue || !timer)
    return ReturnErrorMessage("Could not initialize timer and event queues.");
  if (Verbose) puts("OK");

  UpdateWindowTitle();
#ifdef _WIN32
  al_set_new_bitmap_flags(ALLEGRO_MIN_LINEAR | ALLEGRO_MAG_LINEAR);
  ALLEGRO_BITMAP *iconbm = al_create_bitmap(32,32);
  al_set_target_bitmap(iconbm);
  al_draw_filled_circle(16,16,8,al_map_rgb(255, 0, 0));
  al_set_display_icon(display, iconbm);
  al_destroy_bitmap(iconbm);
#endif

  al_register_event_source(eventQueue, al_get_display_event_source(display));
  //al_register_event_source(eventQueue, al_get_keyboard_event_source());
  al_register_event_source(eventQueue, al_get_default_menu_event_source());
  al_register_event_source(timerQueue, al_get_timer_event_source(timer));

  if (P2000_Mode) { /* M-mode uses black and white palette */
    Pal[0] = Pal[1] = Pal[2] = 0;
    Pal[3] = Pal[4] = Pal[5] = 255;
  }

  if (Verbose) printf("  Allocating cache buffers... ");
  OldCharacter = malloc(80 * 24 * sizeof(int));
  if (!OldCharacter) return ReturnErrorMessage("Could not allocate character buffer.");
  ClearScreen();
  if (Verbose) puts("OK");

  /* sound init */
  if (Verbose) printf("Initializing sound...");
  soundDetected = al_install_audio() && al_reserve_samples(0);
  if (Verbose) puts(soundDetected ? "OK" :"FAILED");
  ResetAudioStream();

  // create menu
  if (Verbose) printf("Creating menu...");
  CreateEmulatorMenu();

  if (Verbose) puts(menu ? "OK" : "FAILED");

  if (startFullScreen)
    ToggleFullscreen();

  /* start the 50Hz/60Hz timer */
  al_start_timer(timer);

  return EXIT_SUCCESS;
}

/****************************************************************************/
/*** This function is called every interrupt to flush sound pipes and     ***/
/*** sync emulation                                                       ***/
/****************************************************************************/
void FlushSound(void)
{
  int i;
  static int soundstate = 0;
  static int sample_count = 1;

  if (soundmode && soundDetected) {
    int8_t *playbuf = al_get_audio_stream_fragment(stream);
    if (playbuf) {
      for (i=0;i<buf_size;++i) {
        if (soundbuf[i]) {
          soundstate=soundbuf[i];
          soundbuf[i]=0;
          sample_count=sample_rate/1000;
        }
        playbuf[i]=soundstate+128;
        if (!--sample_count) {
          sample_count=sample_rate/1000;
          if (soundstate>0) --soundstate;
          if (soundstate<0) ++soundstate;
        }
      }
      al_set_audio_stream_fragment(stream, playbuf);
    }
  }
}

void SyncEmulation(void)
{
  // sync emulation by waiting for timer event (fired 50/60 times a second)
  if (Sync) {
    if (al_get_next_event(timerQueue, &event)) {
      if (Debug)
        printf("Sync lagged behind @ ts %f...\n", event.timer.timestamp);
      while (al_get_next_event(timerQueue, &event)); //drain the timer queue
    }
    else
      al_wait_for_event(timerQueue, &event);   
  }
}

