p2000t/M2000/src/Allegro/Main.c
/****************************************************************************/
/*** This function is called when the sound register is written to        ***/
/****************************************************************************/
void Sound(int toggle)
{
  static int last=-1;
  int pos,val;

  if (!soundmode || !soundDetected) 
    return;

  if (toggle!=last) {
    last=toggle;
    pos=(buf_size-1)-(buf_size*Z80_ICount/Z80_IPeriod);
    val=(toggle)? (-mastervolume*8):(mastervolume*8);
    soundbuf[pos]=val;
  }
}

void drawFontRegion(float x1, float y1, float x2, float y2)
{
  /* Draw the font on an internal bitmap */
  al_set_target_bitmap(FontBuf);
  al_draw_filled_rectangle(x1, y1, x2, y2, al_map_rgb(255, 255, 255));

  /* Draw the inverted font on an internal bitmap */
  al_set_target_bitmap(FontBuf_bk);
  al_draw_filled_rectangle(x1, y1, x2, y2, al_map_rgb(0, 0, 0));
}

/****************************************************************************/
/*** This function loads a font and converts it if necessary              ***/
/****************************************************************************/
int LoadFont(const char *filename)
{
  int i, line, x, y, pixelPos;
  int linePixels, linePixelsPrev, linePixelsNext;
  int pixelN, pixelE, pixelS, pixelW;
  int pixelSW, pixelSE, pixelNW, pixelNE;
  char *TempBuf;
  FILE *F;

  if (Verbose) printf("Loading font %s...\n", filename);
  al_set_new_bitmap_flags(ALLEGRO_CONVERT_BITMAP);
  FontBuf = al_create_bitmap(FONT_BITMAP_WIDTH, CHAR_TILE_HEIGHT);
  FontBuf_bk = al_create_bitmap(FONT_BITMAP_WIDTH, CHAR_TILE_HEIGHT);

  al_set_new_bitmap_flags(ALLEGRO_MIN_LINEAR | ALLEGRO_MAG_LINEAR);
  smFontBuf = al_create_bitmap(FONT_BITMAP_WIDTH, CHAR_TILE_HEIGHT);
  smFontBuf_bk = al_create_bitmap(FONT_BITMAP_WIDTH, CHAR_TILE_HEIGHT);
  
  if (!FontBuf || !FontBuf_bk || !smFontBuf || !smFontBuf_bk )
    return ReturnErrorMessage("Could not create font bitmaps.");

  al_set_target_bitmap(FontBuf);
  al_clear_to_color(al_map_rgb(0, 0, 0));
  al_set_target_bitmap(FontBuf_bk);
  al_clear_to_color(al_map_rgb(255, 255, 255));

  if (Verbose) printf("  Allocating memory for temp buffer for font... ");
  TempBuf = malloc(2240);
  if (!TempBuf)
    return ReturnErrorMessage("Could not allocate temp buffer for font.");
  if (Verbose) puts("OK");

  if (Verbose) printf("  Opening font file %s... ", filename);
  i = 0;
  F = fopen(filename, "rb");
  if (F) {
    if (Verbose) printf("Reading... ");
    if (fread(TempBuf, 2240, 1, F)) i = 1;
    fclose(F);
  }
  if (Verbose) puts(i ? "OK" : "FAILED");
  if (!i) return ReturnErrorMessage("Could not read font file %s", filename);

  // Stretch 6x10 characters to 12x20, so we can do character rounding 
  // 96 alpha + 64 graphic (cont) + 64 graphic (sep)
  for (i = 0; i < (96 + 64 + 64) * 10; i += 10) { 
    linePixelsPrev = 0;
    linePixels = 0;
    linePixelsNext = TempBuf[i] << 6;
    for (line = 0; line < 10; ++line) {
      y = line * CHAR_PIXEL_HEIGHT;
      linePixelsPrev = linePixels >> 6;
      linePixels = linePixelsNext >> 6;
      linePixelsNext = line < 9 ? TempBuf[i + line + 1] : 0;

      for (pixelPos = 0; pixelPos < 6; ++pixelPos) {
        x = (i * 6 / 10 + pixelPos) * CHAR_PIXEL_WIDTH + i / 10 * CHAR_TILE_SPACE;
        if (linePixels & 0x20) // bit 6 set = pixel set
          drawFontRegion(
            x - (pixelPos ? 0 : 1), 
            y - (line ? 0 : 1), 
            x + CHAR_PIXEL_WIDTH + (pixelPos == 5 ? 1 : 0), 
            y + CHAR_PIXEL_HEIGHT+ (line == 9 ? 1 : 0));
        else {
          /* character rounding */
          if (i < 96 * 10) { // check if within alpanum character range
            // for character rounding, look at 8 pixels around current pixel
            pixelN = linePixelsPrev & 0x20;
            pixelE = linePixels & 0x10;
            pixelS = linePixelsNext & 0x20;
            pixelW = linePixels & 0x40;
            pixelNE = linePixelsPrev & 0x10;
            pixelSE = linePixelsNext & 0x10;
            pixelSW = linePixelsNext & 0x40;
            pixelNW = linePixelsPrev & 0x40;
            
            // rounding in NW direction
            if (pixelN && pixelW && !pixelNW) {
              drawFontRegion(x,y,x+CHAR_PIXEL_WIDTH/2,y+CHAR_PIXEL_HEIGHT/2);
            }
            // rounding in NE direction
            if (pixelN && pixelE && !pixelNE) {
              drawFontRegion(x+CHAR_PIXEL_WIDTH/2,y,x+CHAR_PIXEL_WIDTH,y+CHAR_PIXEL_HEIGHT/2);
            }
            // rounding in SE direction
            if (pixelS && pixelE && !pixelSE) {
              drawFontRegion(x+CHAR_PIXEL_WIDTH/2, y+CHAR_PIXEL_HEIGHT/2, x+CHAR_PIXEL_WIDTH, y+CHAR_PIXEL_HEIGHT);
            }
            // rounding in SW direction
            if (pixelS && pixelW && !pixelSW) {
              drawFontRegion(x, y+CHAR_PIXEL_HEIGHT/2, x+CHAR_PIXEL_WIDTH/2, y+CHAR_PIXEL_HEIGHT);
            }
          }
        }
        //process next pixel to the right
        linePixelsPrev<<=1;
        linePixels<<=1;
        linePixelsNext<<=1;
      }
    }
  }
  free(TempBuf);

  // copy the font bitmaps to smoothened bitmaps
  al_set_target_bitmap(smFontBuf);
  al_draw_scaled_bitmap(FontBuf, 0, 0, FONT_BITMAP_WIDTH, CHAR_TILE_HEIGHT, 0, 0, FONT_BITMAP_WIDTH, CHAR_TILE_HEIGHT, 0);
  al_set_target_bitmap(smFontBuf_bk);
  al_draw_scaled_bitmap(FontBuf_bk, 0, 0, FONT_BITMAP_WIDTH, CHAR_TILE_HEIGHT, 0, 0, FONT_BITMAP_WIDTH, CHAR_TILE_HEIGHT, 0); 

  //al_save_bitmap("FontBuf.png", FontBuf);
  return EXIT_SUCCESS;
}

void SaveVideoRAM(const char * filename) 
{
  int i;
  FILE *f;
  if ((f = fopen(filename, "wb")) != NULL) {
    // for each of the 24 lines, write 40 chars and skip 40 chars
    for (i=0;i<24;i++)
      fwrite(VRAM + ScrollReg + i*80, 1, 40, f); 
    fclose(f);
  }
}

void OpenCassetteDialog(bool boot) 
{
  al_show_mouse_cursor(display);
  ALLEGRO_FILECHOOSER *cassetteChooser = NULL;
  cassetteChooser = al_create_native_file_dialog(al_path_cstr(userCassettesPath, PATH_SEPARATOR), _(DIALOG_LOAD_CASSETTE), "*.*", 0); //file doesn't have to exist
  if (al_show_native_file_dialog(display, cassetteChooser) && al_get_native_file_dialog_count(cassetteChooser) > 0) {
    InsertCassette(AppendExtensionIfMissing(al_get_native_file_dialog_path(cassetteChooser, 0), ".cas"));
    al_destroy_path(currentTapePath);
    currentTapePath = al_create_path(TapeName);
    UpdateWindowTitle();
    refreshPath(&userCassettesPath, TapeName);
    if (boot)
      Z80_Reset();
  }
  al_destroy_native_file_dialog(cassetteChooser);
  if (al_get_display_flags(display) & ALLEGRO_FULLSCREEN_WINDOW)
    al_hide_mouse_cursor(display);
}

void IndicateActionDone() {
  //show white screen to indicate action was done
  al_clear_to_color(al_map_rgb(255, 255, 255));
  al_flip_display();
  Pause(20);
  ClearScreen();
}

bool al_key_up(ALLEGRO_KEYBOARD_STATE * kb_state, int kb_event) 
{
  if (!al_key_down(kb_state, kb_event)) return false;
  while (al_key_down(kb_state, kb_event)) al_get_keyboard_state(kb_state);
  return true;
}

