p2000t/M2000/src/Allegro/Main.c
  // Ctrl-R           -  Reset P2000
  if (al_key_down(&kbdstate, ALLEGRO_KEY_LCTRL) && al_key_up(&kbdstate, ALLEGRO_KEY_R))
    Z80_Reset();

  // Ctrl-Enter       -  Toggle fullscreen on/off (not supported on Linux)
  if ((al_key_down(&kbdstate, ALLEGRO_KEY_LCTRL) || al_key_down(&kbdstate, ALLEGRO_KEY_ALT)) && al_key_up(&kbdstate, ALLEGRO_KEY_ENTER))
    ToggleFullscreen();

  // Ctrl-L           -  Toggle scanlines on/off
  if (al_key_down(&kbdstate, ALLEGRO_KEY_LCTRL) && al_key_up(&kbdstate, ALLEGRO_KEY_L)) {
    scanlines = !scanlines;
    ClearScreen();
  }

  // Ctrl-Q           -  Quit emulator
  if (al_key_down(&kbdstate, ALLEGRO_KEY_LCTRL) && al_key_up(&kbdstate, ALLEGRO_KEY_Q))
    Z80_Running = 0;

  // Ctrl-C           -  Save current state to file (without dialog)
  if (al_key_down(&kbdstate, ALLEGRO_KEY_LCTRL) && al_key_up(&kbdstate, ALLEGRO_KEY_C)) {
    SaveState(NULL, userSavestatesPath);
    IndicateActionDone();
  }

  // Ctrl-V           -  Load previously saved state (without dialog)
  if (al_key_down(&kbdstate, ALLEGRO_KEY_LCTRL) && al_key_up(&kbdstate, ALLEGRO_KEY_V))
    LoadState(NULL, userSavestatesPath);

  // Ctrl-S           -  Save screenshot to file (without dialog)
  if (al_key_down(&kbdstate, ALLEGRO_KEY_LCTRL) && al_key_up(&kbdstate, ALLEGRO_KEY_S)) {
    static char extension[25];
    time_t now = time(NULL);
    strftime(extension, 25, " %Y-%m-%d %H-%M-%S.png", localtime(&now));
    al_set_path_filename(userScreenshotsPath, currentTapePath ? al_get_path_filename(currentTapePath) : "Screenshot");
    al_set_path_extension(userScreenshotsPath, extension);
    al_save_bitmap(al_path_cstr(userScreenshotsPath, PATH_SEPARATOR), al_get_target_bitmap());
    IndicateActionDone();
  }

  // Ctrl-R           -  Save visible video RAM to file (without dialog)
  if (al_key_down(&kbdstate, ALLEGRO_KEY_LCTRL) && al_key_up(&kbdstate, ALLEGRO_KEY_R)) {
    static char extension[26];
    time_t now = time(NULL);
    strftime(extension, 26, " %Y-%m-%d %H-%M-%S.vram", localtime(&now));
    al_set_path_filename(userVideoRamDumpsPath, currentTapePath ? al_get_path_filename(currentTapePath) : "VideoRAM");
    al_set_path_extension(userVideoRamDumpsPath, extension);
    SaveVideoRAM(al_path_cstr(userVideoRamDumpsPath, PATH_SEPARATOR));
    IndicateActionDone();
  }
  
  // Ctrl-P           -  Toggle pause on/off
  if (al_key_down(&kbdstate, ALLEGRO_KEY_LCTRL) && al_key_up(&kbdstate, ALLEGRO_KEY_P)) {
    pausePressed = !pausePressed;
    al_set_menu_item_flags(menu, SPEED_PAUSE, pausePressed ? ALLEGRO_MENU_ITEM_CHECKED : ALLEGRO_MENU_ITEM_CHECKBOX);
  }

  // Ctrl-M           -  Toggle mute/unmute
  if (al_key_down(&kbdstate, ALLEGRO_KEY_LCTRL) && al_key_up(&kbdstate, ALLEGRO_KEY_M)) {
    soundmode = !soundmode;
    al_set_menu_item_flags(menu, OPTIONS_SOUND_ID, soundmode ? ALLEGRO_MENU_ITEM_CHECKED : ALLEGRO_MENU_ITEM_CHECKBOX);
  }

  /* press F5 to enable trace in DEBUG mode */
  if (Debug && al_key_up(&kbdstate, ALLEGRO_KEY_F5)) {
    Z80_Trace = 1;
    pausePressed = 1;
  }

  // handle joystick
  if (joymode && joyDetected) {
    al_get_joystick_state(joystick, &joyState);
    for (i = 0; i < 5; i++) { // 4 directions and 1 button
      if ((i < 4 && joyState.stick[0].axis[i%2]*(-2.0*(i/2)+1.0) > 0.5) ||
          (i == 4 && joyState.button[0])) {
        PushKey(joyKeyMapping[joymap][i]);
        lastJoyState[i] = 1;
      }
      else {
        if (lastJoyState[i]) ReleaseKey(joyKeyMapping[joymap][i]);
        lastJoyState[i] = 0;
      }
    }
  } 
}

/****************************************************************************/
/*** Pause specified ammount of time                                      ***/
/****************************************************************************/
void Pause(int ms) 
{
  al_rest((double)ms / 1000.0);
}

void DrawTileScanlines(int tileX, int tileY) 
{
  float i;
  float vpixel = DisplayTileHeight/30.0;
  ALLEGRO_COLOR evenLineColor = al_map_rgba(0, 0, 0, 50);
  ALLEGRO_COLOR scanlineColor = al_map_rgba(0, 0, 0, 120);
  for (i=DisplayVBorder+tileY*DisplayTileHeight; i<DisplayVBorder+(tileY+1)*DisplayTileHeight; i+=3.0*vpixel)
  {
    al_draw_line(DisplayHBorder + tileX*DisplayTileWidth, i+0.45*vpixel, DisplayHBorder + (tileX+1)*DisplayTileWidth, i+0.45*vpixel, scanlineColor, vpixel);
    al_draw_line(DisplayHBorder + tileX*DisplayTileWidth, i+2.45*vpixel, DisplayHBorder + (tileX+1)*DisplayTileWidth, i+2.45*vpixel, evenLineColor, vpixel);
  }
}

/****************************************************************************/
/*** This function is called by the screen refresh drivers to copy the    ***/
/*** off-screen buffer to the actual display                              ***/
/****************************************************************************/
static void PutImage (void)
{
  al_flip_display();
}

/****************************************************************************/
/*** Put a character in the display buffer for P2000M emulation mode      ***/
/****************************************************************************/
static inline void PutChar_M(int x, int y, int c, int eor, int ul) 
{
  int K = c + (eor << 8) + (ul << 16);
  if (K == OldCharacter[y * 80 + x])
    return;
  OldCharacter[y * 80 + x] = K;

  al_set_target_bitmap(al_get_backbuffer(display));
  al_draw_scaled_bitmap(
    eor ? (smoothing ? smFontBuf_bk : FontBuf_bk) : (smoothing ? smFontBuf : FontBuf), 
    c * (CHAR_TILE_WIDTH + CHAR_TILE_SPACE), 0.0, CHAR_TILE_WIDTH, CHAR_TILE_HEIGHT, 
    DisplayHBorder + 0.5 * x * DisplayTileWidth, DisplayVBorder + y * DisplayTileHeight, 
    0.5 * DisplayTileWidth, DisplayTileHeight, 0);
  if (ul)
    al_draw_filled_rectangle(
      DisplayHBorder + 0.5 * x * DisplayTileWidth, DisplayVBorder + (y + 1) * DisplayTileHeight - 2.0, 
      DisplayHBorder + 0.5 * (x + 1) * DisplayTileWidth, DisplayVBorder + (y + 1) * DisplayTileHeight - 1.0, 
      al_map_rgb(255, 255, 255));
  if (scanlines) DrawTileScanlines(x, y);
}

