p2000t/M2000/src/Allegro/Main.c
/****************************************************************************/
/*** Put a character in the display buffer for P2000T emulation mode      ***/
/****************************************************************************/
static inline void PutChar_T(int x, int y, int c, int fg, int bg, int si)
{
  int K = c + (fg << 8) + (bg << 16) + (si << 24);
  if (K == OldCharacter[y * 40 + x])
    return;
  OldCharacter[y * 40 + x] = K;

  al_set_target_bitmap(al_get_backbuffer(display));
  al_draw_tinted_scaled_bitmap(
    smoothing ? smFontBuf : FontBuf,
    al_map_rgba(Pal[fg * 3], Pal[fg * 3 + 1], Pal[fg * 3 + 2], 255), 
    c * (CHAR_TILE_WIDTH + CHAR_TILE_SPACE), (si >> 1) * CHAR_TILE_HEIGHT/2, 
    CHAR_TILE_WIDTH, si ? CHAR_TILE_HEIGHT/2 : CHAR_TILE_HEIGHT,
    DisplayHBorder + x * DisplayTileWidth, DisplayVBorder + y * DisplayTileHeight,
    DisplayTileWidth, DisplayTileHeight, 0);
  if (bg)
    al_draw_tinted_scaled_bitmap(
      smoothing ? smFontBuf_bk : FontBuf_bk,
      al_map_rgba(Pal[bg * 3], Pal[bg * 3 + 1], Pal[bg * 3 + 2], 0), 
      c * (CHAR_TILE_WIDTH + CHAR_TILE_SPACE), (si >> 1) * CHAR_TILE_HEIGHT/2, 
      CHAR_TILE_WIDTH, si ? CHAR_TILE_HEIGHT/2 : CHAR_TILE_HEIGHT,
      DisplayHBorder + x * DisplayTileWidth, DisplayVBorder + y * DisplayTileHeight,
      DisplayTileWidth, DisplayTileHeight, 0);
  if (scanlines) DrawTileScanlines(x, y);
}

char *GetResourcesPath() 
{
  strcpy (ProgramPath, al_path_cstr(al_get_standard_path(ALLEGRO_RESOURCES_PATH), PATH_SEPARATOR));

  // debian install check
  if (!strcmp(ProgramPath,"/usr/bin/"))
    strcpy(ProgramPath, "/usr/share/M2000/");

  return ProgramPath;
}

char *GetDocumentsPath() 
{
  strcpy(DocumentPath, GetResourcesPath()); //fallback to program path
  ALLEGRO_PATH *docPath = al_get_standard_path(ALLEGRO_USER_DOCUMENTS_PATH);
  if (docPath) {
    al_append_path_component(docPath, "M2000");
    if (al_make_directory(al_path_cstr(docPath, PATH_SEPARATOR)))
      strcpy(DocumentPath, al_path_cstr(docPath, PATH_SEPARATOR));
    al_destroy_path(docPath);
  }
  return DocumentPath;
}

int main(int argc,char *argv[]) 
{
  if (!al_init()) return ReturnErrorMessage("Allegro could not initialize its core.");
  if (!al_init_primitives_addon()) return ReturnErrorMessage("Allegro could not initialize primitives addon.");
  if (!al_init_image_addon()) return ReturnErrorMessage("Allegro could not initialize image addon.");
  if (!al_init_native_dialog_addon()) return ReturnErrorMessage("Allegro could not initialize native dialog addon.");
  if (!al_install_keyboard())return ReturnErrorMessage("Allegro could not install keyboard.");

  /* create M2000 folder inside user's Documents folder */
  docPath = al_get_standard_path(ALLEGRO_USER_DOCUMENTS_PATH);
  al_append_path_component(docPath, "M2000");
  if (!al_make_directory(al_path_cstr(docPath, PATH_SEPARATOR))) return ReturnErrorMessage("Can't create documents folder %s.", al_path_cstr(docPath, PATH_SEPARATOR));

  InitConfig();
  if (Verbose) {
    uint32_t version = al_get_allegro_version();
    printf("Using Allegro libs version %i.%i.%i\n",version >> 24, (version >> 16) & 255, (version >> 8) & 255);
  }
  return M2000_main(argc, argv);
}
